adoptingerlang.org
#+TITLE:     Adopting Erlang
#+AUTHOR:    Fred Hebert, Tristan Sloughter
#+DRAWERS: HIDDEN HINT SOLUTION
#+EMAIL:     t@crashfast.com
#+DATE:      \today
#+DESCRIPTION: Adopting Erlang.
#+KEYWORDS: erlang

# \setcounter{secnumdepth}{-1}

#+LATEX_CLASS: book
#+LATEX_CLASS_OPTIONS: [oneside,11pt]
#+ATTR_LATEX: :width 4in
#+OPTIONS: H:6
#+LATEX_HEADER: \usepackage[Bjornstrup]{fncychap}
#+LATEX_HEADER: \usepackage[svgnames]{xcolor}
#+LATEX_HEADER: \usepackage[tikz]{bclogo}
#+LATEX_HEADER: \usepackage{hyperref}
#+LATEX_HEADER: \usepackage{minted}
#+latex_header: \usepackage{xcolor}
#+latex_header: \usemintedstyle{monokai}    %% sets default for all source-code blocks
#+latex_header: \definecolor{friendlybg}{HTML}{f0f0f0}
#+latex_header: \definecolor{dark}{HTML}{272822}   %% custom colour for background
#+latex_header: \setminted{style=friendly, bgcolor=friendlybg, frame=lines, breaklines, breakanywhere}
#+LATEX_HEADER: \newenvironment{alert}{\begin{bclogo}}{\end{bclogo}}
#+LATEX_HEADER: \newenvironment{notice}{\begin{bclogo}}{\end{bclogo}}
#+OPTIONS: ^:{}
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: docs
#+HUGO_PAIRED_SHORTCODES: %alert
#+HUGO_PAIRED_SHORTCODES: %notice

** Systemd
:PROPERTIES:
:EXPORT_FILE_NAME: systemd
:END:

*** Systemd Unit

#+BEGIN_src shell
[Unit]
Description=Service Discovery Runner
After=network.target

[Service]
WorkingDirectory=/opt/service_discovery
EnvironmentFile=/etc/default/service_discovery.env
ExecStart=/opt/service_discovery/bin/service_discovery foreground
Restart=on-failure
Environment=RELX_OUT_FILE_PATH=/tmp/
Environment=COOKIE=service_discovery_cookie

[Install]
WantedBy=multi-user.target
#+END_src

As of OTP 19.3 a =SIGTERM= signal causes the OTP VM to gracefully shutdown.

#+BEGIN_src shell
journalctl service_discovery
#+END_src
